app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_rating
    session[:last_search] = params if !params[:order_by].nil? || !params[:ratings].nil?
    @search_params = params[:order_by].nil? && params[:ratings].nil? ? session[:last_search] : params
    case @search_params[:order_by]
    when "title"
      @movies = Movie.ratings_search(@search_params).order_by_title
---
SELECT "movies".* FROM "movies" WHERE (rating in ('G','R')) ORDER BY release_date